{"pageProps":{"projectData":{"id":"roomlr","contentHtml":"<h4>My Role</h4>\n<p>I was lead frontend-developer on the project. I was responsible for frontend development.</p>\n<p>We developed <em>Singe Page Application</em> (SPA) first. It was based on <strong>Backbone/jQuery</strong>. SPA contained following pages:</p>\n<ul>\n<li>homepage with search bar</li>\n<li>list of apartments with complex filters</li>\n<li>aparmtent details page with availability calendar</li>\n<li>booking page</li>\n</ul>\n<p>Later we added server-side rendering on <strong>Python/Flask</strong> for SEO purposes. We used same Handlebars templates on both server and client.</p>\n<p>We widely used <strong>Google Maps API</strong> on the project as well.</p>\n<h4>About Roomlr</h4>\n<p>Roomlr is a worldwide search engine for every type of holiday home or apartment.\nWhatever you may wish to rent – chalet, houseboat, apartment or entire house – you'll find it here.\nWith its database of 1.4 million locations, Roomlr offers a new and fast, easy alternative for finding a holiday home or apartment anywhere in the world.</p>\n<p>Mission: present the most extensive range worldwide, combined with a powerful search engine. Having found a location, clients can book via the partner’s website. Roomlr offers a complete overview for every house: location, most competitive price, availability, quality photos, descriptions, ratings, detailed maps and every possible amenity. Roomlr is easy to use and optimised for desktop, smartphone and tablet.</p>\n<h4>Publications</h4>\n<ul>\n<li><a href=\"https://roomlr.pr.co/71015-sanomaventures-invests-in-roomlr-the-search-engine-for-holiday-homes\">SanomaVentures invests in Roomlr, the search engine for holiday homes</a></li>\n</ul>\n","title":"Roomlr - worldwide locator of holiday homes and apartments","start":"2013-03-08","end":"2014-11-15","image":"/img/projects/roomlr/roomlr.jpg","url":"https://www.roomlr.com/","technologies":["jQuery","Backbone","Bootstrap","Google Maps API","Python"],"images":["/img/projects/roomlr/home.jpg","/img/projects/roomlr/list.jpg","/img/projects/roomlr/apartment.jpg"]}},"__N_SSG":true}