{"pageProps":{"projectData":{"id":"rampnalysis","contentHtml":"<p><a href=\"https://youtu.be/g7Uec4ZRsQ8\">Video demonstration</a></p>\n<h2>My Role</h2>\n<p>I have build dashboard and 2 embeddable widgets on <strong>React</strong>. I used <strong>React</strong> hooks for data fetching most of time. Design was provided in <em>Figma</em>. I used <strong>Bootstrap 4</strong> as CSS framework.</p>\n<p>Dashboard pages I developed:</p>\n<ul>\n<li><em>All coutries</em> page includes: supported counties on map and datagrid with search and filtering.</li>\n<li><em>All cryptocurrencies</em> page includes datagrid with search and sorting.</li>\n<li><em>Cryptocurrency</em> page includes: <strong>Coingecko</strong> price chart, news about the cryptocyrrency, trading widget and list of providers.</li>\n<li><em>Provider</em> info page includes: news about the provider, supported counties on map, supported payment options list, supported blockchain networks list, supported cryptocurrencies list.</li>\n<li>Blockchain <em>network</em> page includes: network-related news, list of providers with supported tokens, crypto coverage datagrid with search.</li>\n<li><em>News</em> page includes: search bar, list of news, and some simple statistics.</li>\n<li><em>Search</em> page includes: search results with lists of providers, cryptocurrencies and networks.</li>\n<li><em>Notifications</em> page simply represents data from server.</li>\n</ul>\n<p>Embeddable widgets I made:</p>\n<ul>\n<li><em>Best crypto assets</em> helps to find best provider by payment method, coutry, cryptocurrency and fiat.</li>\n<li><em>Trading widget</em> allows to find the best deal for crypto exchange operation. User inputs amounts of fiat and crypto, payment method and gets the best rate among all providers.</li>\n</ul>\n<p>Features: maps, tables and lists, embeddable widgets.</p>\n<p>Technologies: <strong>React</strong>, <strong>Bootstrap 4</strong>, <strong>Google Maps API</strong>.</p>\n<h2>About Project</h2>\n<p>Rampnalysis is a crypto exchange platform where user can compare providers rates and select the best possible price. <em>Provider</em> is a website where user can buy/sell crypto coins. Rampnalysis didn't have payment integration when I worked on it. Platform redirect to provider's website for actual crypto processing.</p>\n<p>Rampnalysis provides integration with a number of providers (websites):</p>\n<ul>\n<li>Mercuryo</li>\n<li>Xanpool</li>\n<li>Banxa</li>\n<li>Ramp</li>\n<li>Alchemy Pay</li>\n<li>BTC Direct</li>\n<li>Transak</li>\n<li>Wyre</li>\n<li>Moonpay</li>\n</ul>\n<p>Dashboard has maps (<strong>Google Maps</strong>), tables and lists.</p>\n<p>Embeddable widgets has forms with validation and sophisticated UI and aimed to be published on 3rd-party websites.</p>\n","title":"Rampnalysis - crypto exchange platform","start":"2022-11-03","end":"2023-01-19","image":"/img/projects/2022/Rampnalysis2022/Crypto.png","technologies":["React","Bootstrap","Google Maps API"],"images":["/img/projects/2022/Rampnalysis2022/Crypto.png","/img/projects/2022/Rampnalysis2022/Network.png","/img/projects/2022/Rampnalysis2022/Provider.png","/img/projects/2022/Rampnalysis2022/Countries.png","/img/projects/2022/Rampnalysis2022/News-Rampnalysis.png","/img/projects/2022/Rampnalysis2022/All-crypto.png","/img/projects/2022/Rampnalysis2022/Notifications-Rampnalysis.png"],"video":"https://youtu.be/g7Uec4ZRsQ8"}},"__N_SSG":true}